mrsgit09Docset0516221715/articles/MS-SSAS/fb2243ba-3c65-4dc8-9626-e7992f3a3504.md

<html dir="LTR" xmlns:mshelp="http://msdn.microsoft.com/mshelp" xmlns:ddue="http://ddue.schemas.microsoft.com/authoring/2003/5" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:tool="http://www.microsoft.com/tooltip">
    <head>
        <meta http-equiv="Content-Type" content="text/html; CHARSET=utf-8"></meta>
        <meta name="save" content="history"></meta>
        <title>3.1.3.2 Initialization for HTTP Transport</title>
        <xml>
            <mshelp:toctitle title="3.1.3.2 Initialization for HTTP Transport"></mshelp:toctitle>
            <mshelp:rltitle title="[MS-SSAS]: Initialization for HTTP Transport"></mshelp:rltitle>
            <mshelp:keyword index="A" term="fb2243ba-3c65-4dc8-9626-e7992f3a3504"></mshelp:keyword>
            <mshelp:attr name="DCSext.ContentType" value="open specification"></mshelp:attr>
            <mshelp:attr name="AssetID" value="fb2243ba-3c65-4dc8-9626-e7992f3a3504"></mshelp:attr>
            <mshelp:attr name="TopicType" value="kbRef"></mshelp:attr>
            <mshelp:attr name="DCSext.Title" value="[MS-SSAS]: Initialization for HTTP Transport" />
        </xml>
    </head>
    <body>
        <div id="header">
            <h1 class="heading">3.1.3.2 Initialization for HTTP Transport</h1>
        </div>
        <div id="mainSection">
            <div id="mainBody">
                <div id="allHistory" class="saveHistory"></div>
                <div id="sectionSection0" class="section" name="collapseableSection">
                    

<p>The client sends the following command to retrieve the
session token from the server that has X-AS-GetSessionToken that contains the
value &quot;true&quot; in the HTTP header.</p>

<dl>
<dd>
<div><pre> &lt;Envelope xmlns=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
   &lt;Header&gt;
     &lt;BeginGetSessionToken soap:mustUnderstand=&quot;1&quot; xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns=&quot;urn:schemas-microsoft-com:xml-analysis&quot; /&gt;
     &lt;Version Sequence=&quot;400&quot; xmlns=&quot;http://schemas.microsoft.com/analysisservices/2003/engine/2&quot; /&gt;
   &lt;/Header&gt;
   &lt;Body&gt;
     &lt;Execute xmlns=&quot;urn:schemas-microsoft-com:xml-analysis&quot;&gt;
       &lt;Command&gt;
         &lt;Statement /&gt;
       &lt;/Command&gt;
     &lt;/Execute&gt;
   &lt;/Body&gt;
 &lt;/Envelope&gt;
</pre></div>
</dd></dl>

<p>The following is included in the SOAP response message from
the server.</p>

<dl>
<dd>
<div><pre> &lt;soap:Envelope xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
   &lt;soap:Header&gt;
     &lt;SessionToken&gt; 
     &lt;!--if the SOAP response body receives the session token, the--&gt;
     &lt;!--BeginSession header embeds the session token in the--&gt;
     &lt;!--body of the message here.--&gt;
     &lt;/SessionToken&gt;
   &lt;/soap:Header&gt;
   &lt;soap:Body&gt;
     &lt;ExecuteResponse xmlns=&quot;urn:schemas-microsoft-com:xml-analysis&quot;&gt;
       &lt;return /&gt;
     &lt;/ExecuteResponse&gt;
   &lt;/soap:Body&gt;
 &lt;/soap:Envelope&gt;
  
</pre></div>
</dd></dl>

<p>If SessionToken is received in the SOAP response message,
the <b>BeginSession</b> <a href="8676f5ce-62d4-4244-a326-634bfed4aba4.htm#gt_093a0af2-e71c-40fc-a484-d2f802da0277">SOAP
header</a> embeds SessionToken in the body of the message as shown in the
following example.</p>

<dl>
<dd>
<div><pre> &lt;Envelope xmlns=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
   &lt;Header&gt;
     &lt;BeginSession soap:mustUnderstand=&quot;1&quot; xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns=&quot;urn:schemas-microsoft-com:xml-analysis&quot; /&gt;
     &lt;Version Sequence=&quot;400&quot; xmlns=&quot;http://schemas.microsoft.com/analysisservices/2003/engine/2&quot; /&gt;
   &lt;/Header&gt;
   &lt;Body&gt;
     &lt;Execute xmlns=&quot;urn:schemas-microsoft-com:xml-analysis&quot;&gt;
       &lt;Command&gt;
       &lt;ExtAuth&gt;
     &lt;AuthenticationScheme&gt;DelegateToken&lt;/AuthenticationScheme&gt;
                &lt;ExtAuthInfo&gt;
        &lt;!--if the SOAP response body receives the session token,--&gt;
        &lt;!--the BeginSession header embeds the session token--&gt;
        &lt;!--in the body of the message here.--&gt;
      &lt;/ExtAuthInfo&gt;
       &lt;/ExtAuth&gt;
         &lt;/Command&gt;
       &lt;Properties&gt;
         &lt;PropertyList&gt;
           &lt;LocaleIdentifier&gt;1033&lt;/LocaleIdentifier&gt;
         &lt;/PropertyList&gt;
       &lt;/Properties&gt;
     &lt;/Execute&gt;
   &lt;/Body&gt;
 &lt;/Envelope&gt;
</pre></div>
</dd></dl>

<p>If the SessionToken is not received in the SOAP response
message or if there is an error in the response, the <b>BeginSession</b> SOAP
header is as shown in the following example.</p>

<dl>
<dd>
<div><pre> &lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;
 &lt;Envelope xmlns=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
   &lt;Header&gt;
     &lt;BeginSession xmlns=&quot;urn:schemas-microsoft-com:xml-analysis&quot; mustUnderstand=&quot;1&quot;/&gt;
    &lt;/Header&gt;
    &lt;Body&gt;
     ...&lt;!-- Discover or Execute element goes here.--&gt;
    &lt;/Body&gt;
 &lt;/Envelope&gt;
</pre></div>
</dd></dl>

<p>The SOAP response message from the server includes the
session ID in the SOAP header.</p>

<dl>
<dd>
<div><pre> &lt;Header&gt;
  &lt;Session
   xmlns=&quot;urn:schemas-microsoft-com:xml-analysis&quot;
   SessionId=&quot;537C61C6-827C-4305-83A6-C8CE4A91001B&quot;/&gt;
 &lt;/Header&gt;
</pre></div>
</dd></dl>

<p>For each subsequent request, the client MUST include the
session ID that is provided by the server.</p>

<dl>
<dd>
<div><pre> &lt;Header&gt;
  &lt;Session
   xmlns=&quot;urn:schemas-microsoft-com:xml-analysis&quot;
   mustUnderstand=&quot;1&quot;
   SessionId=&quot;537C61C6-827C-4305-83A6-C8CE4A91001B&quot;/&gt;
 &lt;/Header&gt;
</pre></div>
</dd></dl>

<p>To end the session, the client MUST send the <b>EndSession</b>
header that contains the related session ID value to the server.</p>

<dl>
<dd>
<div><pre> &lt;Header&gt;
  &lt;EndSession
   xmlns=&quot;urn:schemas-microsoft-com:xml-analysis&quot;
   mustUnderstand=&quot;1&quot;
   SessionId=&quot;537C61C6-827C-4305-83A6-C8CE4A91001B&quot;/&gt;
 &lt;/Header&gt;
</pre></div>
</dd></dl>

<p>Sessions MUST be supported on the server.<a id="Appendix_A_Target_99"></a><a href="b9ac4859-2662-44ca-b131-9addd8b953dc.htm#Appendix_A_99" aria-label="Product behavior note 99">&lt;99&gt;</a></p>

<p>Multiple commands can be executed in the context of a single
session. The server MAY<a id="Appendix_A_Target_100"></a><a href="b9ac4859-2662-44ca-b131-9addd8b953dc.htm#Appendix_A_100" aria-label="Product behavior note 100">&lt;100&gt;</a> choose
to time out an active session after a period of inactivity.</p>

<p>The SOAP header elements and attributes for initiating,
maintaining, and closing a session for HTTP transport are the same as the SOAP
header elements and attributes that this protocol defines for non-HTTP
transport (section <a href="3942e7de-b86d-47b1-81d6-e752da4e1f21.htm">3.1.3.1</a>).</p>

<p>If the session ID that is specified in the <b>Session</b> or
<b>EndSession</b> SOAP header is not valid or has timed out, the server MUST
return a <a href="8676f5ce-62d4-4244-a326-634bfed4aba4.htm#gt_ec8728a8-1a75-426f-8767-aa1932c7c19f">SOAP fault</a>.</p>


                </div>
            </div>
        </div>
    </body>
</html>